{
  "clause_id": "C-QUERY-SYNTAX",
  "title": "Query Syntax",
  "kind": "normative",
  "status": "active",
  "text": "**Query semantics:**\nThe `<query>` argument is treated as a **bag-of-words** query with implicit AND. Each word in the query must appear somewhere in the document for a match; word order and adjacency are NOT required.\n\nExample: Query `configure authentication` matches documents containing both words anywhere in the content, regardless of order or proximity.\n\n**Tokenizer-dependent matching:**\nQuery matching behavior depends on the tokenizer used to build the index (recorded in `index_meta.tokenizer`):\n- `porter`: Terms are stemmed. Query `configuring` matches indexed `configure`.\n- `unicode61`: No stemming. Query `configuring` does NOT match `configure`.\n\nFTS5 handles tokenizer selection internally based on how the index was created. The implementation does not need to branch on tokenizer type; FTS5 applies the correct tokenizer automatically. However, the recorded tokenizer value is useful for debugging, diagnostics, and user understanding of matching behavior.\n\n**Query tokenization:**\nTo construct a bag-of-words AND query, the implementation MUST:\n1. Split the query on ASCII whitespace only (space U+0020, tab U+0009, newline U+000A, carriage return U+000D)\n2. Remove empty tokens\n3. For each non-empty token:\n   a. Escape internal `\"` by doubling (`\"` → `\"\"`)\n   b. Wrap in double quotes to make it a literal FTS5 term\n4. Join all quoted tokens with spaces (implicit AND in FTS5)\n\n**Unicode whitespace limitation:**\nNon-ASCII whitespace characters (e.g., non-breaking space U+00A0, ideographic space U+3000) are NOT treated as token separators. They are included as part of the token. This is a known limitation. Users should use ASCII spaces in queries.\n\nExample: User input `configure authentication` becomes FTS5 query `\"configure\" \"authentication\"`.\n\nExample with quotes: User input `my \"special\" app` becomes FTS5 query `\"my\" \"\"\"special\"\"\" \"app\"`.\n\n**Why this works:**\nEach quoted token is passed to FTS5 as a single-term phrase. FTS5 applies its internal tokenizer (matching the index) to each term, handling Unicode normalization and stemming as appropriate. Multiple quoted terms joined by spaces create an implicit AND query.\n\n**Note on punctuation:**\nPunctuation attached to words (e.g., `hello,` or `(world)`) is passed to FTS5 as-is. FTS5's tokenizer will strip it during matching.\n\n**Shell quoting:**\nThe query is passed as a single shell argument. Users MUST quote multi-word queries:\n```bash\nskc search my-skill \"configure authentication\"  # Correct\nskc search my-skill configure authentication    # Wrong: two positional args\n```\n\n**Empty query:**\nIf the query is empty or contains only ASCII whitespace, the command MUST exit with error E004. See [[RFC-0005:C-CODES]] for the canonical message.\n\n**Future extension:**\n- `--raw` — Pass raw FTS5 syntax for advanced users\n- `--phrase` — Require adjacency (true phrase matching)\n\nThese flags are NOT part of v0.1.0.",
  "since": "0.1.0"
}
