{
  "clause_id": "C-LOGGING",
  "title": "Access Logging",
  "kind": "normative",
  "status": "active",
  "text": "All commands that resolve skills MUST log access events for usage analytics.\n\n**Log storage:**\nLogs MUST be stored in a SQLite database at `.skillc-meta/logs.db` in the resolved runtime directory.\n\n**Schema:**\nThe database MUST contain an `access_log` table with at minimum:\n- `id` — Auto-incrementing primary key\n- `timestamp` — RFC 3339 UTC timestamp (`YYYY-MM-DDTHH:MM:SSZ`)\n- `run_id` — Session identifier\n- `command` — Command name (the `skc` subcommand, e.g., `outline`, `show`, `open`, `search`, `build`, `stats`)\n- `skill` — Skill name (directory basename)\n- `skill_path` — Canonicalized absolute path to the resolved skill source directory\n- `cwd` — Canonicalized absolute path of the current working directory when command was invoked\n- `args` — JSON-encoded command arguments\n- `error` — Error message if command failed (NULL on success)\n\nCanonicalization MUST resolve `.` and `..` path segments and MUST resolve symlinks to their real paths.\n\n**Run ID generation:**\nIf `SKC_RUN_ID` environment variable is set, use its value. Otherwise, generate a run ID in the format `YYYYMMDDTHHMMSSZ-<rand4>` where `<rand4>` is 4 random hex characters.\n\n**Initialization:**\nThe command MUST attempt to create the runtime directory, `.skillc-meta/` subdirectory, database, and schema if they do not exist.\n\n**Fallback logging (EAFP):**\nThe command MUST first attempt to write to the primary runtime directory. If the INSERT fails with a read-only error (e.g., sandboxed filesystem), the command MUST fall back to `<cwd>/.skillc/logs/<skill-name>/.skillc-meta/logs.db`. The fallback directory and database MUST be created if they do not exist.\n\nIf both primary and fallback locations fail, the command MUST emit a warning to stderr:\n`warning: logging disabled; run 'skc sync' after session to merge logs`\n\n**Stale fallback warning:**\nIf fallback logs exist for the current skill and the database file's mtime is older than 1 hour, the command SHOULD emit a warning to stderr:\n`warning: stale local logs for '<skill>'; run 'skc sync' to upload`\n\nThis warning SHOULD be emitted at most once per command invocation (not per skill if multiple skills are accessed).\n\nThe command MUST continue execution regardless of logging success.",
  "since": "0.1.0"
}
